
# 练习
# 1.求1-100之间可以被6整除的数的个数
cnt = 0
for i in range(1, 101):
    if i % 6 == 0:
        cnt += 1
print(f'第1题：1-100之间可以被6整除的数的个数 => {cnt}')

# 2.计算1到100以内所有偶数的和。
s = 0
for i in range(0, 101, 2):
    s += i
print(f'第2题：计算1到100以内所有偶数的和 => {s}')

# 3.计算1到100以内所有能被3或者7整除的数的和。
s = 0
for i in range(1, 101):
    if i % 3 == 0 or i % 7 == 0:
        s += i
print(f'第3题：计算1到100以内所有能被3或者7整除的数的和 => {s}')

# 4.计算1到100以内能同时被7和3整除的数的个数。
cnt = 0
for i in  range(1, 101):
    if i % 3 == 0 and i % 7 == 0:
        cnt += 1
print(f'第4题：计算1到100以内能同时被7和3整除的数的个数 => {cnt}')

# 5. 求 1-2 + 3-4 + 5-6 ……… + 97-98 + 99-100的结果
res = 0
for i in range(1, 101):
    if i % 2 == 1:
        res += i
    else:
        res -= i
print('第5题：求 1-2 + 3-4 + 5-6 ……… + 97-98 + 99-100的结果 => %d' % res)


# 扩展题目：
# 6. 求 1/1 - 1/2 + 1/3 - 1/4 + 1/5 - 1/6 ……… + 1/97 - 1/98 + 1/99 - 1/100的结果
res = 0
for i in range(1, 101):
    if i % 2 == 1:
        res += 1 / i
    else:
        res -= 1 / i
print('第6题：求 1/1 - 1/2 + 1/3 - 1/4 + 1/5 - 1/6 ……… + 1/97 - 1/98 + 1/99 - 1/100的结果 => {}'.format(res))



# 7.丈母娘要彩礼:
#   小伙马上要准备结婚，丈母娘看小伙实诚，同意让小伙分30期给彩礼，分期规则如下
#   分期： 第1天给1分钱
#         第2天给2分钱
#         第3天给4分钱
#         第4天给8分钱
#         第5天给16分钱
#         ...
#         第30天
# 如果是你，会同意吗,为什么？
s = 0
for i in range(30):
    s += 2 ** i
print(f'第7题：总共要给彩礼 => {s // 100}元')


